SET NAMES UTF8;
DROP DATABASE IF EXISTS food;
CREATE DATABASE food	CHARSET=UTF8;
USE food;
CREATE TABLE swipe(
	id INT PRIMARY KEY AUTO_INCREMENT,
	img_url VARCHAR(100)
);
INSERT INTO swipe VALUES
(1,'http://127.0.0.1:3000/img/iterator0.jpg'), 
(2,'http://127.0.0.1:3000/img/iterator1.jpg'),
(3,'http://127.0.0.1:3000/img/iterator2.jpg'),
(null,'http://127.0.0.1:3000/img/iterator3.jpg'),
(null,'http://127.0.0.1:3000/img/iterator4.jpg'),
(null,'http://127.0.0.1:3000/img/iterator5.jpg');

CREATE TABLE type(
	id INT PRIMARY  KEY AUTO_INCREMENT,
	img_url VARCHAR(80),
	type VARCHAR(5)
);
INSERT INTO type VALUES
(1,'http://127.0.0.1:3000/img/type1.png','10'),
(null,'http://127.0.0.1:3000/img/type2.png','20'),
(null,'http://127.0.0.1:3000/img/type3.png','30'),
(null,'http://127.0.0.1:3000/img/type4.png','40'),
(null,'http://127.0.0.1:3000/img/type5.png','50'),
(null,'http://127.0.0.1:3000/img/type6.png','60'),
(null,'http://127.0.0.1:3000/img/type7.png','70'),
(null,'http://127.0.0.1:3000/img/type8.png','80'),
(null,'http://127.0.0.1:3000/img/type9.png','90');

CREATE TABLE menu(
	id INT PRIMARY  KEY AUTO_INCREMENT,
	img_url VARCHAR(80),
	title VARCHAR(50),
	info VARCHAR(220),
	type VARCHAR(5),
	recom BOOL
);
INSERT INTO menu VALUES
(1,'http://127.0.0.1:3000/img/hui/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',10,1),
(null,'http://127.0.0.1:3000/img/hui/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',10,1),
(null,'http://127.0.0.1:3000/img/hui/3.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',10,0),
(null,'http://127.0.0.1:3000/img/su/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',20,1),
(null,'http://127.0.0.1:3000/img/su/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',20,0),
(null,'http://127.0.0.1:3000/img/su/3.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',20,1),
(null,'http://127.0.0.1:3000/img/min/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',30,0),
(null,'http://127.0.0.1:3000/img/min/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',30,1),
(null,'http://127.0.0.1:3000/img/min/3.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',30,0),
(null,'http://127.0.0.1:3000/img/chuan/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',40,1),
(null,'http://127.0.0.1:3000/img/chuan/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',40,1),
(null,'http://127.0.0.1:3000/img/chuan/3.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',40,0),
(null,'http://127.0.0.1:3000/img/zhe/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',50,1),
(null,'http://127.0.0.1:3000/img/zhe/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',50,0),
(null,'http://127.0.0.1:3000/img/zhe/3.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',50,0),
(null,'http://127.0.0.1:3000/img/xiang/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',60,0),
(null,'http://127.0.0.1:3000/img/xiang/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',60,0),
(null,'http://127.0.0.1:3000/img/xiang/3.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',60,0),
(null,'http://127.0.0.1:3000/img/lu/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',70,0),
(null,'http://127.0.0.1:3000/img/lu/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',70,0),
(null,'http://127.0.0.1:3000/img/lu/3.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',70,0),
(null,'http://127.0.0.1:3000/img/yue/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',80,0),
(null,'http://127.0.0.1:3000/img/yue/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',80,0),
(null,'http://127.0.0.1:3000/img/yue/3.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',80,0),
(null,'http://127.0.0.1:3000/img/other/1.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',90,0),
(null,'http://127.0.0.1:3000/img/other/2.jpg','鱼香肉丝',' 鱼香肉丝是一道精美的川菜，据科学研究，多吃一口鱼香肉丝所补充的微量元素是吃人参的三倍，中医也认为吃鱼香肉丝可以延年益寿，滋阴补阳，调节肝脾，尤其对月经不调的女性，鱼香肉丝是治疗宫寒最合适的食膳。',90,0);